import { CellType, type LevelData } from '@/types';

// Map Legend:
// 0: Empty (Outside)
// 1: Wall
// 2: Floor (Walkable)
// 3: Target
// 4: Box
// 5: Player

export const levels: LevelData[] = [
  {
    id: 1,
    name: "初出茅庐",
    difficulty: "Easy",
    map: [
      [1, 1, 1, 1, 1, 0, 0, 0],
      [1, 5, 2, 2, 1, 0, 0, 0],
      [1, 2, 4, 2, 1, 0, 0, 0],
      [1, 2, 4, 3, 1, 0, 0, 0],
      [1, 3, 2, 2, 1, 0, 0, 0],
      [1, 1, 1, 1, 1, 0, 0, 0]
    ]
  },
  {
    id: 2,
    name: "小试牛刀",
    difficulty: "Medium",
    map: [
      [1, 1, 1, 1, 1, 1, 1, 1],
      [1, 2, 2, 2, 2, 2, 2, 1],
      [1, 2, 2, 4, 2, 2, 2, 1],
      [1, 2, 3, 4, 3, 2, 5, 1],
      [1, 2, 2, 4, 2, 2, 2, 1],
      [1, 2, 2, 3, 2, 2, 2, 1],
      [1, 1, 1, 1, 1, 1, 1, 1]
    ]
  },
  {
    id: 3,
    name: "全新挑战",
    difficulty: "Hard",
    map: [
      [0, 0, 1, 1, 1, 1, 1, 0],
      [1, 1, 1, 2, 2, 2, 1, 0],
      [1, 5, 2, 4, 3, 2, 1, 0],
      [1, 2, 1, 1, 4, 2, 1, 0],
      [1, 2, 3, 2, 2, 2, 1, 0],
      [1, 1, 1, 1, 1, 1, 1, 0]
    ]
  }
];
